/**
 * ErrorCodeEnum.java
 */
package utils;

/**
 * @author jinzf
 * @date Feb 15, 2015
 * @description TODO
 * @version 1.0
 */
public enum ResultCodeEnum {
    未知的状态码(-1),
	成功(0),
	
	密码出错(1000),
	用户不存在(1001),
	用户已存在(1002),
	验证码错误(1003),
	验证码失效(1004),
	验证码已验证(1005),
	用户名格式不正确(1006),
	密码格式不正确(1007),
	手机号格式不正确(1008),
	手机号已存在(1009),
	手机号错误(1010),
	身份证格式不正确(1011),
	身份证错误(1012),
	邮箱格式不正确(1013),
	邮箱错误(1014),
	银行卡已被绑定(1015),
	每个账户银行卡绑定已达最大值(1016),
	银行卡号格式错误(1017),
	服务协议未同意(1018),
	异常访问(1100),
	页面过期(1101),
	此功能当日短信已用完(1102),
	此ip当日短信已用完(1103),
	//----------------安全设置begin-----------------------//
	原密码格式不正确(2100),
	新密码格式不正确(2101),
	原密码错误(2102),
	邮箱验证码错误(2103),
	验证码发送过于频繁(2104),
	邮箱已存在(2105),
	安保问题错误(2106),
	//----------------安全设置end-------------------------//
	连续登录失败次数超过3次(1010),
	
	//----------------阳关村务-------------------------//
	行政区划代码已存在(3000),
	不能删除根节点(3001),
	不能删除存在后台用户的单位及其子单位(3002),
	非法身份(9998),	
	参数异常(9999),
	系统异常(10000),
  //----------------短信-------------------------//
	短信验证码发送过频繁(160038),
	超出同模板同号天发送次数上限(160039),
	验证码超出同模板同号码天发送上限(160040),
	通知超出同模板同号码天发送上限(160041), 		
	号码格式有误(160042), 		
	应用与模板id不匹配(160043),		
	短信发送失败 (160050); 		
	
	public final int flag;
	private ResultCodeEnum(int f){
		this.flag = f;
	}
}
